app/controllers/casein/brands_controller.rb

SELECT  "brands".* FROM "brands"  ORDER BY name   LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "brands"
---
    def index
      @casein_page_title = 'Brands'
  		@brands = Brand.order(sort_order(:name)).paginate :page => params[:page]

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 4]]
---
    def show
      @casein_page_title = 'View brand'
      @brand = Brand.find params[:id]