app/controllers/casein/customers_controller.rb

SELECT  "customers".* FROM "customers"  ORDER BY name   LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "customers"
---
    def index
      @casein_page_title = 'Customers'
  		@customers = Customer.order(sort_order(:name)).paginate :page => params[:page]

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 7]]
---
    def show
      @casein_page_title = 'View customer'
      @customer = Customer.find params[:id]