app/controllers/casein/designers_controller.rb

    def index
      @casein_page_title = 'Designers'
  		@designers = Designer.order(sort_order(:email)).paginate :page => params[:page]
---
SELECT  "designers".* FROM "designers"  ORDER BY email   LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "designers"