app/views/brand_mailer/brand_upload_email.html.erb

  <body>
    Hi, <%= @brand.designer.first_name %>
---
SELECT  "designers".* FROM "designers" WHERE "designers"."id" = ?  ORDER BY "designers"."id" ASC LIMIT 1  [["id", 1]]