app/views/order_mailer/sold_brand_email.html.erb

  <body>
    Hi, <%= @order.line_items.last.brand.designer.first_name %>
---
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  ORDER BY "line_items"."id" DESC LIMIT 1  [["order_id", 4]]