app/controllers/after_signup_controller.rb

  def update
    @designer = current_designer
    @designer.update(designer_params)
---
UPDATE "designers" SET "website_url" = ?, "facebook_url" = ?, "dribbble_url" = ?, "updated_at" = ? WHERE "designers"."id" = ?  [["website_url", "http://www.twoweekmvp.com"], ["facebook_url", ""], ["dribbble_url", ""], ["updated_at", "2015-05-30 20:16:07.379639"], ["id", 2]]