app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands"
---
  def index
    @brands = Brand.all

INSERT INTO "brands" ("name", "description", "price", "designer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @brand = current_designer.brands.new(brand_params)

    respond_to do |format|
      if @brand.save

UPDATE "brands" SET "name" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["name", "Nikkee"], ["updated_at", "2015-06-03 16:49:47.637183"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @brand.update(brand_params)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_brand
      @brand = Brand.find_by(id: params[:id])

SELECT  "brands".* FROM "brands" WHERE "brands"."designer_id" = ? AND "brands"."id" = ? LIMIT 1  [["designer_id", 1], ["id", 1]]
UPDATE "designers" SET "first_brand" = ?, "updated_at" = ? WHERE "designers"."id" = ?  [["first_brand", "f"], ["updated_at", "2015-06-02 19:18:43.956943"], ["id", 6]]
---
    def set_first_brand_boolean_to_false
      current_designer.first_brand = false
      current_designer.save