app/controllers/charges_controller.rb

  def index
    @charges = Charge.all
---
SELECT "charges".* FROM "charges"

  def new
    @charge = Charge.new
    @customer = Customer.find(params[:customer])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 3]]

  def process_payment
    @charge = Charge.new
    @customer = Customer.find(params[:customer_id])

    Stripe::Charge.create({
      :amount => @customer.amount * 100,
      :currency => 'usd',
      :application_fee => (@customer.amount * 100) / 5,
      :customer => @customer.stripe_customer_id,
      :destination => @customer.designer_uid
    })
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "charges" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-30 00:52:05.615060"], ["updated_at", "2015-05-30 00:52:05.615060"]]

    def set_charge
      @charge = Charge.find(params[:id])
---
SELECT  "charges".* FROM "charges" WHERE "charges"."id" = ? LIMIT 1  [["id", 2]]