app/controllers/create_brand_controller.rb

  def update
    @designer = current_designer
    @brand = current_brand
    @brand.update(brand_params)
---
UPDATE "brands" SET "thumbnail_file_name" = ?, "thumbnail_content_type" = ?, "thumbnail_file_size" = ?, "thumbnail_updated_at" = ?, "updated_at" = ? WHERE "brands"."id" = ?