app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def destroy
    @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 8]]

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 8]]