app/controllers/designers_controller.rb

UPDATE "designers" SET "website_url" = ?, "facebook_url" = ?, "dribbble_url" = ?, "profile_pic_file_name" = ?, "profile_pic_content_type" = ?, "profile_pic_file_size" = ?, "profile_pic_updated_at" = ?, "updated_at" = ? WHERE "designers"."id" = ?
---
  def update
    respond_to do |format|
      if @designer.update(designer_params)

SELECT  "designers".* FROM "designers" WHERE "designers"."id" = ?  ORDER BY "designers"."id" ASC LIMIT 1  [["id", 1]]
---
  def set_designer
    @designer = Designer.find(params[:id])