app/controllers/line_items_controller.rb

  def create
    # find current cart (or create one if necessary)
    # add brand to cart, then display cart contents
    @cart = current_cart
    brand = Brand.find(params[:brand_id])
    @line_item = @cart.add_brand(brand.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-28 21:36:30.144765"], ["updated_at", "2015-05-28 21:36:30.144765"]]
INSERT INTO "line_items" ("brand_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["brand_id", 1], ["cart_id", 1], ["created_at", "2015-05-28 21:36:30.177049"], ["updated_at", "2015-05-28 21:36:30.177049"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-06-07 03:35:45.811764"], ["id", 13]]