app/controllers/orders_controller.rb

  def new
    # checks cart to see if there are
    # items in it. If not, then the
    # user is redirected to the root_path
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]

  def create
    @order = Order.new(order_params)
    @cart = current_cart

    # add line items from cart to order
    @order.add_line_items_from_current_cart(current_cart)

    # get the credit card details from submitted form
    token = params[:stripeToken]

    # create a customer
    customer = Stripe::Customer.create(
      :email => @order.email,
      :card => token,
      :description => "Purchase of #{@cart.line_items.last.brand.name} Brand for $#{@cart.total_cart_price}"
    )

    # create local customer record with
    # customer_id saved for later charging
    # and designer_uid for routing payment to
    # correct designer of brand
    @local_customer = Customer.new
    @local_customer.update_attributes(:stripe_customer_id => customer.id,
                                      :email => @order.email,
                                      :name => @order.name,
                                      :designer_uid => @order.line_items.last.brand.designer.designer_uid,
                                      :designer_email => @order.line_items.last.brand.designer.email,
                                      :amount => @cart.total_cart_price)
---
INSERT INTO "customers" ("stripe_customer_id", "email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["stripe_customer_id", "cus_6KDNYII3cCtFY2"], ["email", "menewhere@gmail.com"], ["name", "Me new Lee"], ["created_at", "2015-05-28 21:53:51.546449"], ["updated_at", "2015-05-28 21:53:51.546449"]]
INSERT INTO "orders" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Me new Lee"], ["email", "menewhere@gmail.com"], ["created_at", "2015-05-28 21:53:51.552708"], ["updated_at", "2015-05-28 21:53:51.552708"]]
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  ORDER BY "line_items"."id" DESC LIMIT 1  [["order_id", 4]]
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "designers".* FROM "designers" WHERE "designers"."id" = ? LIMIT 1  [["id", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]

        # set new session cart to nil
        @order.line_items.last.brand.archived = true
        @order.line_items.last.brand.active = false
        @order.line_items.last.brand.save
        Cart.destroy(session[:cart_id])
---
UPDATE "brands" SET "archived" = ?, "active" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["archived", "t"], ["active", "f"], ["updated_at", "2015-06-01 20:35:57.829793"], ["id", 1]]
UPDATE "line_items" SET "cart_id" = ?, "order_id" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["cart_id", nil], ["order_id", 1], ["updated_at", "2015-05-28 21:53:51.554826"], ["id", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]

    def set_order
      @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 4]]